{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "mobilenet_1.00_224", "output_layers": [["reshape_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"name": "conv1", "bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"name": "conv1_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "config": {"name": "conv_dw_1", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"name": "conv_dw_1_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pw_1", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"name": "conv_pw_1_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"name": "conv_dw_2", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"name": "conv_dw_2_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"name": "conv_pw_2", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"name": "conv_pw_2_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"name": "conv_pad_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "config": {"name": "conv_dw_3", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"name": "conv_dw_3_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pw_3", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"name": "conv_pw_3_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"name": "conv_dw_4", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"name": "conv_dw_4_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"name": "conv_pw_4", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"name": "conv_pw_4_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"name": "conv_pad_5", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "config": {"name": "conv_dw_5", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"name": "conv_dw_5_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pw_5", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"name": "conv_pw_5_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"name": "conv_dw_6", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"name": "conv_dw_6_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"name": "conv_pw_6", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"name": "conv_pw_6_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"name": "conv_pad_7", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "config": {"name": "conv_dw_7", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"name": "conv_dw_7_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"name": "conv_pw_7", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"name": "conv_pw_7_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"name": "conv_pad_8", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "config": {"name": "conv_dw_8", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"name": "conv_dw_8_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"name": "conv_pw_8", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"name": "conv_pw_8_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"name": "conv_pad_9", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "config": {"name": "conv_dw_9", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"name": "conv_dw_9_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"name": "conv_pw_9", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"name": "conv_pw_9_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"name": "conv_pad_10", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "config": {"name": "conv_dw_10", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"name": "conv_dw_10_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"name": "conv_pw_10", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"name": "conv_pw_10_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"name": "conv_pad_11", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "config": {"name": "conv_dw_11", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"name": "conv_dw_11_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pw_11", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 512, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"name": "conv_pw_11_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"name": "conv_dw_12", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"name": "conv_dw_12_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"name": "conv_pw_12", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 1024, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"name": "conv_pw_12_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pad_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"name": "conv_pad_13", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "config": {"name": "conv_dw_13", "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "trainable": true, "depthwise_constraint": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"name": "conv_dw_13_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"name": "conv_pw_13", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 1024, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": false, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"name": "conv_pw_13_bn", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "dtype": "float32", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "trainable": true, "dtype": "float32", "activation": "relu6"}, "class_name": "Activation"}, {"name": "global_average_pooling2d", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"name": "reshape_1", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 1024]}, "class_name": "Reshape"}, {"name": "dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "dropout", "dtype": "float32", "seed": null, "rate": 0.001, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"name": "conv_preds", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"name": "conv_preds", "bias_constraint": null, "padding": "same", "kernel_size": [1, 1], "filters": 1000, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "act_softmax", "inbound_nodes": [[["conv_preds", 0, 0, {}]]], "config": {"name": "act_softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "class_name": "Activation"}, {"name": "reshape_2", "inbound_nodes": [[["act_softmax", 0, 0, {}]]], "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [1000]}, "class_name": "Reshape"}], "input_layers": [["input_1", 0, 0]]}}, "keras_version": "2.2.4-tf"}, "weightsManifest": [{"weights": [{"name": "conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "conv_dw_10/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_10_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_11_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_12_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_13/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 1024, 1]}, {"name": "conv_dw_13_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_variance", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": 